Autodesk.AdvanceSteel.CADAccess.Transaction.Abort
closes the transaction, discards all changes

Autodesk.AdvanceSteel.CADAccess.Transaction.Commit(System.Boolean)
closes the transaction, commits all changes
bPropagateChanges: If true, a changes propagation step is executed
to ensure all connections and other AS entities are up to date, if false, we continue under the
assumptions that all changes are correct and coherent and skip the propagation step

Autodesk.AdvanceSteel.CADAccess.Transaction.Commit
closes the transaction, commits all changes and executes a changes propagation step
which means updates all connections that may need update, workplanes, fitter, etc